Autodesk.Revit.UI.SketchGalleryOptions
Enumerates all the sketch options.
Since:
2017

Autodesk.Revit.UI.SketchGalleryOptions.SGO_SketchLanding
Sketch a landing.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_SketchRun
Sketch a run.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_LandingWithTwoRuns
Pick two runs to create a landing.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_WinderUShape
Sketch a U-Shape winder.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_SupportPickLine
Pick a line to create a support.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_WinderPattern
Pick winder pattern.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_WinderLShape
Sketch a L-Shape winder.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_LandingSquare
Sketch a landing square.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_RunArcCenterEnds
Sketch a Center-Ends spiral for a run of stairs.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_RunArcFullStep
Sketch a Full-Step spiral for a run of stairs.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_RunLine
Sketch a line for a run of stairs.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_PointElement
Pick point element.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_PickPoints
Pick points.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_Point
Pick a point.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_PickRoofs
Pick roofs.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_PickSupports
Pick supports.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_PickWalls
Pick walls.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_PickFaces
Pick faces.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_PickLines
Pick lines.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_PartialEllipse
Sketch a partial ellipse.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_FullEllipse
Sketch a full ellipse.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_SplineByPoints
Sketch a spline by points.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_Spline
Sketch a spline.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_ArcFillet
Sketch a fillet arc.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_ArcTanEnd
Sketch a Tangent-End arc.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_ArcCenterEnds
Sketch a Center-Ends arc.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_Arc3Point
Sketch a Start-End-Radius arc.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_Circle
Sketch a circle.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_CircumscribedPolygon
Sketch a circumscribed polygon.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_InscribedPolygon
Sketch an inscribed polygon.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_Rect
Sketch a rectangle.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_Line
Sketch a line.

Autodesk.Revit.UI.SketchGalleryOptions.SGO_Default
The default option which means the real option is decided by Revit internally.